#ifndef __VIS_MESS_H
#define __VIS_MESS_H

/******************************** 说明 *********************************/

/*
 * 信息集是硬件网管信息与上层访问的接口。网管信息可通过ID号来访问。
 * 网管信息ID  由三部分组成:index +InfoSetID +ItemID,相同结构的信息可以放在同一个
 * 信息集里，不同的信息集可以组合成新的信息集。信息集里的信息项可以
 * 绑定到网管信号。也可以不绑定，需要访问网管信号时再具体实现。
 */

/********************************* Includes ***********************************/
#include <typedefs.h>
/********************************** Defines ***********************************/
#define MAX_MESSAGE_SIZE 32
//#define MAX_ITEM_COUNT 16

#endif /* __VIS_MESS */

/******************************************************************************/



